tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86j50_tdd.h
#define T4CKPS1                       522
#define TMR4ON                        523
#define T4OUTPS                       524
#define T4OUTPS0                      525
#define T4OUTPS1                      526
#define T4OUTPS2                      527
#define T4OUTPS3                      528
#define CVRCON                        529
#define CVR                           530
#define CVR0                          531
#define CVR1                          532
#define CVR2                          533
#define CVR3                          534
#define CVRSS                         535
#define CVRR                          536
#define CVROEN                        537
#define CVROE                         538
#define CVREN                         539
#define T3CON                         540
#define TMR3ON                        541
#define TMR3CS                        542
#define nT3SYNC                       543
#define NOT_T3SYNC                    544
#define T3SYNC                        545
#define T3INSYNC                      546
#define SOSCEN3                       547
#define T3CCP1                        548
#define T3CKPS                        549
#define T3CKPS0                       550
#define T3CKPS1                       551
#define T3CCP2                        552
#define T3CON_RD16                    553
#define RD163                         554
#define T3RD16                        555
#define BAUDCON2                      556
#define BAUDCON2_ABDEN                557
#define ABDEN2                        558
#define WUE2                          559
#define BAUDCON2_WUE                  560
#define BRG162                        561
#define BAUDCON2_BRG16                562
#define BAUDCON2_SCKP                 563
#define SCKP2                         564
#define BAUDCON2_TXCKP                565
#define TXCKP2                        566
#define DTRXP2                        567
#define RXDTP2                        568
#define BAUDCON2_DTRXP                569
#define BAUDCON2_RXDTP                570
#define RCMT2                         571
#define RCIDL2                        572
#define BAUDCON2_RCIDL                573
#define BAUDCON2_RCMT                 574
#define BAUDCON2_ABDOVF               575
#define ABDOVF2                       576
#define BAUDCON1                      577
#define BAUDCON1_ABDEN                578
#define ABDEN1                        579
#define BAUDCON1_WUE                  580
#define WUE1                          581
#define W4E                           582
#define BRG161                        583
#define BAUDCON1_BRG16                584
#define CKTXP                         585
#define BAUDCON1_TXCKP                586
#define SCKP1                         587
#define BAUDCON1_SCKP                 588
#define TXCKP1                        589
#define DTRXP1                        590
#define RXDTP1                        591
#define RXCKP                         592
#define BAUDCON1_DTRXP                593
#define BAUDCON1_RXDTP                594
#define BAUDCON1_RCMT                 595
#define RCMT1                         596
#define RCIDL1                        597
#define BAUDCON1_RCIDL                598
#define ABDOVF1                       599
#define BAUDCON1_ABDOVF               600
#define PORTA                         601
#define AN0                           602
#define ULPWUIN                       603
#define PORTA_RA0                     604
#define AN1                           605
#define PORTA_RA1                     606
#define AN2                           607
#define PORTA_RA2                     608
#define VREFM                         609
#define AN3                           610
#define PORTA_RA3                     611
#define VREFP                         612
#define PORTA_RA4                     613
#define PORTA_PMD5                    614
#define T0CKI                         615
#define AN4                           616
#define PORTA_PMD4                    617
#define PORTA_RA5                     618
#define LVDIN                         619
#define C2INA                         620
#define CLKO                          621
#define PORTA_RA6                     622
#define OSC2                          623
#define PORTA_RA7                     624
#define PORTA_RJPU                    625
#define PORTB                         626
#define FLT0                          627
#define INT0                          628
#define PORTB_RB0                     629
#define PMA4                          630
#define INT1                          631
#define PORTB_RB1                     632
#define PMA3                          633
#define INT2                          634
#define PORTB_RB2                     635
#define PMA2                          636
#define INT3                          637
#define CCP2_PA2                      638
#define PORTB_CCP2                    639
#define PORTB_RB3                     640
#define PMA1                          641
#define KBI0                          642
#define PORTB_RB4                     643
#define PMA0                          644
#define PGC                           645
#define KBI1                          646
#define PORTB_RB5                     647
#define PGD                           648
#define KBI2                          649
#define PORTB_RB6                     650
#define KBI3                          651
#define PORTB_RB7                     652
#define PORTC                         653
#define T13CKI                        654
#define T1OSO                         655
#define PORTC_RC0                     656
#define PORTC_CCP2                    657
#define T1OSI                         658
#define PA2                           659
#define PORTC_RC1                     660
#define CCP1                          661
#define PA1                           662
#define PORTC_RC2                     663
#define SCL                           664
#define SCK                           665
#define PORTC_RC3                     666
#define SDA                           667
#define SDI                           668
#define PORTC_RC4                     669
#define C2OUT                         670
#define SDO                           671
#define PORTC_RC5                     672
#define TX                            673
#define CK                            674
#define PORTC_RC6                     675
#define DT                            676
#define RX                            677
#define PORTC_RC7                     678
#define PORTD                         679
#define PORTD_PMD0                    680
#define PORTD_RD0                     681
#define AD0                           682
#define PORTD_PMD1                    683
#define AD1                           684
#define PORTD_RD1                     685
#define PORTD_PMD2                    686
#define AD2                           687
#define PORTD_RD2                     688
#define PORTD_PMD3                    689
#define AD3                           690
#define PORTD_RD3                     691
#define PORTD_RD4                     692
#define PORTD_PMD4                    693
#define AD4                           694
#define SDO2                          695
#define PORTD_PMD5                    696
#define SDI2                          697
#define AD5                           698
#define SDA2                          699
#define PORTD_RD5                     700
#define SCK2                          701
#define PORTD_PMD6                    702
#define AD6                           703
#define SCL2                          704
#define PORTD_RD6                     705
#define SS2                           706
#define PORTD_PMD7                    707
#define AD7                           708
#define PORTD_RD7                     709
#define PORTE                         710
#define PD2                           711
#define AD8                           712
#define RDE                           713
#define PORTE_RE0                     714
#define PORTE_PMRD                    715
#define AD9                           716
#define PORTE_PMWR                    717
#define WRE                           718
#define PORTE_RE1                     719
#define PC2                           720
#define PORTE_RE2                     721
#define CS                            722
#define CCP10                         723
#define PB2                           724
#define PORTE_PMBE                    725
#define AD10                          726
#define PORTE_RE3                     727
#define CCP9E                         728
#define PMA13                         729
#define REFO                          730
#define AD11                          731
#define PC3E                          732
#define PB3E                          733
#define PORTE_RE4                     734
#define PMA12                         735
#define AD12                          736
#define CCP8E                         737
#define PORTE_RE5                     738
#define PMA11                         739
#define CCP7E                         740
#define AD13                          741
#define PC1E                          742
#define CCP6E                         743
#define PORTE_RE6                     744
#define PMA10                         745
#define AD14                          746
#define PB1E                          747
#define PORTE_CCP2                    748
#define CCP2E                         749
#define PMA9                          750
#define PA2E                          751
#define PORTE_RE7                     752
#define AD15                          753
#define PORTF                         754
#define AN7                           755
#define PORTF_RF2                     756
#define C1OUTF                        757
#define PMA5                          758
#define C2INB                         759
#define PORTF_RF3                     760
#define PORTF_RF4                     761
#define C1INB                         762
#define PORTF_RF5                     763
#define CVREF                         764
#define AN10                          765
#define PORTF_PMD2                    766
#define C1INA                         767
#define PORTF_RF6                     768
#define AN11                          769
#define PORTF_PMD1                    770
#define PORTF_RF7                     771
#define C1OUT                         772
#define SS                            773
#define PORTF_PMD0                    774
#define PORTG                         775
#define CCP3                          776
#define PMA8                          777
#define PORTG_RG0                     778
#define PMA7                          779
#define C3OUTG                        780
#define TX2                           781
#define PORTG_RG1                     782
#define CK2                           783
#define PMA6                          784
#define RX2                           785
#define PORTG_RG2                     786
#define DT2                           787
#define PMCS1                         788
#define CCP4                          789
#define PORTG_RG3                     790
#define PMCS2                         791
#define CCP5                          792
#define PORTG_RG4                     793
#define PORTG_RJPU                    794
#define RG5                           795
#define REPU                          796
#define RG6                           797
#define RDPU                          798
#define RG7                           799
#define PORTH                         800
#define PORTH_RH0                     801
#define A16                           802
#define PORTH_RH1                     803
#define A17                           804
#define PORTH_RH2                     805
#define A18                           806
#define PORTH_PMD7                    807
#define PORTH_RH3                     808
#define A19                           809
#define PORTH_PMD6                    810
#define PORTH_RH4                     811
#define CCP9                          812
#define C2INC                         813
#define PORTH_PMD3                    814
#define PC3                           815
#define AN12                          816
#define PORTH_PMBE                    817
#define PORTH_RH5                     818
#define CCP8                          819
#define PB3                           820
#define C2IND                         821
#define AN13                          822
#define C1INC                         823
#define PC1                           824
#define PORTH_RH6                     825
#define CCP7                          826
#define PORTH_PMRD                    827
#define AN14                          828
#define CCP6                          829
#define PB1                           830
#define PORTH_PMWR                    831
#define PORTH_RH7                     832
#define AN15                          833
#define PORTJ                         834
#define ALE                           835
#define PORTJ_RJ0                     836
#define OE                            837
#define PORTJ_RJ1                     838
#define WRL                           839
#define PORTJ_RJ2                     840
#define WRH                           841
#define PORTJ_RJ3                     842
#define BA0                           843
#define PORTJ_RJ4                     844
#define CE                            845
#define PORTJ_RJ5                     846
#define LB                            847
#define PORTJ_RJ6                     848
#define PORTJ_RJ7                     849
#define UB                            850
#define LATA                          851
#define LATA0                         852
#define LA0                           853
#define LATA1                         854
#define LA1                           855
#define LATA2                         856
#define LA2                           857
#define LATA3                         858
#define LA3                           859
#define LATA4                         860
#define LA4                           861
#define LATA5                         862
#define LA5                           863
#define LATA6                         864
#define LA6                           865
#define LATA7                         866
#define LA7                           867
#define LATB                          868
#define LB0                           869
#define LATB0                         870
#define LB1                           871
#define LATB1                         872
#define LB2                           873
#define LATB2                         874
#define LB3                           875
#define LATB3                         876
#define LB4                           877
#define LATB4                         878
#define LB5                           879
#define LATB5                         880
#define LB6                           881
#define LATB6                         882
#define LB7                           883
#define LATB7                         884
#define LATC                          885
#define LATC0                         886
#define LC0                           887
#define LATC1                         888
#define LC1                           889
#define LATC2                         890
#define LC2                           891
#define LATC3                         892
#define LC3                           893
#define LATC4                         894
#define LC4                           895
#define LATC5                         896
#define LC5                           897
#define LATC6                         898
#define LC6                           899
#define LATC7                         900
#define LC7                           901
#define LATD                          902
#define LATD0                         903
#define LD0                           904
#define LATD1                         905
#define LD1                           906
#define LATD2                         907
#define LD2                           908
#define LATD3                         909
#define LD3                           910
#define LATD4                         911
#define LD4                           912
#define LATD5                         913
#define LD5                           914
#define LATD6                         915
#define LD6                           916
#define LATD7                         917
#define LD7                           918
#define LATE                          919
#define LATE0                         920
#define LE0                           921
#define LATE1                         922
#define LE1                           923
#define LATE2                         924
#define LE2                           925
#define LATE3                         926
#define LE3                           927
#define LATE4                         928
#define LE4                           929
#define LATE5                         930
#define LE5                           931
#define LATE6                         932
#define LE6                           933
#define LATE7                         934
#define LE7                           935
#define LATF                          936
#define LF2                           937
#define LATF2                         938
#define LF3                           939
#define LATF3                         940
#define LF4                           941
#define LATF4                         942
#define LF5                           943
#define LATF5                         944
#define LF6                           945
#define LATF6                         946
#define LF7                           947
#define LATF7                         948
#define LATG                          949
#define LATG0                         950
#define LG0                           951
#define LATG1                         952
#define LG1                           953
#define LATG2                         954
#define LG2                           955
#define LATG3                         956
#define LG3                           957
#define LATG4                         958
#define LG4                           959
#define LATH                          960
#define LH0                           961
#define LATH0                         962
#define LH1                           963
#define LATH1                         964
#define LH2                           965
#define LATH2                         966
#define LH3                           967
#define LATH3                         968
#define LH4                           969
#define LATH4                         970
#define LH5                           971
#define LATH5                         972
#define LH6                           973
#define LATH6                         974
#define LH7                           975
#define LATH7                         976
#define LATJ                          977
#define LATJ0                         978
#define LJ0                           979
#define LATJ1                         980
#define LJ1                           981
#define LATJ2                         982
#define LJ2                           983
#define LATJ3                         984
#define LJ3                           985
#define LATJ4                         986
#define LJ4                           987
#define LATJ5                         988
#define LJ5                           989
#define LATJ6                         990
#define LJ6                           991
#define LATJ7                         992
#define LJ7                           993
#define TRISA                         994
#define TRISA0                        995
#define TRISA_RA0                     996
#define TRISA1                        997
#define TRISA_RA1                     998
#define TRISA2                        999
#define TRISA_RA2                     1000
#define TRISA3                        1001
#define TRISA_RA3                     1002
#define TRISA_RA4                     1003
#define TRISA4                        1004
#define TRISA_RA5                     1005
#define TRISA5                        1006
#define TRISA_RA6                     1007
#define TRISA6                        1008
#define TRISA_RA7                     1009
#define TRISA7                        1010
#define TRISB                         1011
#define TRISB_RB0                     1012
#define TRISB0                        1013
#define TRISB_RB1                     1014
#define TRISB1                        1015
#define TRISB_RB2                     1016
#define TRISB2                        1017
#define TRISB_RB3                     1018
#define TRISB3                        1019
#define TRISB_RB4                     1020
#define TRISB4                        1021
#define TRISB_RB5                     1022
#define TRISB5                        1023
#define TRISB_RB6                     1024
#define TRISB6                        1025
#define TRISB_RB7                     1026
#define TRISB7                        1027
#define TRISC                         1028
#define TRISC0                        1029
#define TRISC_RC0                     1030
#define TRISC1                        1031
#define TRISC_RC1                     1032
#define TRISC2                        1033
#define TRISC_RC2                     1034
#define TRISC3                        1035
#define TRISC_RC3                     1036
#define TRISC4                        1037
#define TRISC_RC4                     1038
#define TRISC5                        1039
#define TRISC_RC5                     1040
#define TRISC6                        1041
#define TRISC_RC6                     1042
#define TRISC7                        1043
#define TRISC_RC7                     1044
#define TRISD                         1045
#define TRISD_RD0                     1046
#define TRISD0                        1047
#define TRISD_RD1                     1048
#define TRISD1                        1049
#define TRISD_RD2                     1050
#define TRISD2                        1051
#define TRISD_RD3                     1052
#define TRISD3                        1053
#define TRISD_RD4                     1054
#define TRISD4                        1055
#define TRISD_RD5                     1056
#define TRISD5                        1057
#define TRISD_RD6                     1058
#define TRISD6                        1059
#define TRISD_RD7                     1060
#define TRISD7                        1061
#define TRISE                         1062
#define TRISE_RE0                     1063
#define TRISE0                        1064
#define TRISE1                        1065
#define TRISE_RE1                     1066
#define TRISE2                        1067
#define TRISE_RE2                     1068
#define TRISE_RE3                     1069
#define TRISE3                        1070
#define TRISE_RE4                     1071
#define TRISE4                        1072
#define TRISE_RE5                     1073
#define TRISE5                        1074
#define TRISE_RE6                     1075
#define TRISE6                        1076
#define TRISE_RE7                     1077
#define TRISE7                        1078
#define TRISF                         1079
#define TRISF_RF2                     1080
#define TRISF2                        1081
#define TRISF_RF3                     1082
#define TRISF3                        1083
#define TRISF_RF4                     1084
#define TRISF4                        1085
#define TRISF_RF5                     1086
#define TRISF5                        1087
#define TRISF_RF6                     1088
#define TRISF6                        1089
#define TRISF7                        1090
